#Chapter07. 데이터 준비하기 : 다듬기, 변형, 병합

In [1]:
import pandas as pd
import numpy as np
from pandas import Series
from pandas import DataFrame

##7.1 데이터 합치기

- pandas.merge는 하나 이상의 키를 기준으로 DataFrame의 로우를 합친다. SQL 이나 다른 관계형 데이터 베이스의 join 연산과 유사하다.
- pandas.concat은 하나의 축을 따라 객체를 이어 붙인다.
- combine_first 인스턴스 메서드는 두 객체를 포개서 한 객체에서 누락된 데이터를 다른 객체에 있는 값으로 채울 수 있도록 한다.

###7.1.1 데이터베이스 스타일로 DataFrame 합치기

In [2]:
df1 = DataFrame({'key':['b','b','a','c','a','a','b'],
                 'data':range(7)})

In [3]:
df2 = DataFrame({'key':['a','b','d'],
                 'data2':range(3)})

In [4]:
df1

   data key
0     0   b
1     1   b
2     2   a
3     3   c
4     4   a
5     5   a
6     6   b

In [5]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [6]:
#어떤 column을 병합할 것인지 명시하지않은 경우 -> 겹쳐지는 column의 이름을 키로 사용('key'를 공통으로 사용)
pd.merge(df1,df2)

   data key  data2
0     0   b      1
1     1   b      1
2     6   b      1
3     2   a      0
4     4   a      0
5     5   a      0

In [7]:
#어떤 column을 병합할 것인지 명시해주는 것이 좋음
pd.merge(df1,df2,on='key')

   data key  data2
0     0   b      1
1     1   b      1
2     6   b      1
3     2   a      0
4     4   a      0
5     5   a      0

In [8]:
df3 = DataFrame({'lkey':['b','b','a','c','a','a','b'],
                 'data1':range(7)})

In [9]:
df4 = DataFrame({'rkey':['a','b','d'],
                 'data2':range(3)})

In [10]:
df3

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [11]:
df4

   data2 rkey
0      0    a
1      1    b
2      2    d

In [12]:
#공통되는 column이 없으면 지정해주면 됨
pd.merge(df3,df4,left_on='lkey',right_on='rkey')
#merge는 내부조인(inner join)을 수행하여 교집합 결과를 반환

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [13]:
print df1
print df2

   data key
0     0   b
1     1   b
2     2   a
3     3   c
4     4   a
5     5   a
6     6   b
   data2 key
0      0   a
1      1   b
2      2   d

In [14]:
#how 인자로 'left','right','outer'를 넘겨서 각각 왼쪽 우선 외부조인, 오른쪽 우선 외부조인, 완전 외부조인을 수행한다.
pd.merge(df1,df2,how='outer')

   data key  data2
0     0   b      1
1     1   b      1
2     6   b      1
3     2   a      0
4     4   a      0
5     5   a      0
6     3   c    NaN
7   NaN   d      2

In [15]:
#왼쪽인자(df1을 우선순위로 한 외부조인을 수행)
pd.merge(df1,df2,how='left')

   data key  data2
0     0   b      1
1     1   b      1
2     2   a      0
3     3   c    NaN
4     4   a      0
5     5   a      0
6     6   b      1

In [16]:
df1 = DataFrame({'key':['b','b','a','c','a','b'],
                 'data1':range(6)})
df2 = DataFrame({'key':['a','b','a','b','d'],
                 'data2':range(5)})

In [17]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [18]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [19]:
pd.merge(df1,df2,on='key',how='left')

    data1 key  data2
0       0   b      1
1       0   b      3
2       1   b      1
3       1   b      3
4       2   a      0
5       2   a      2
6       3   c    NaN
7       4   a      0
8       4   a      2
9       5   b      1
10      5   b      3

In [20]:
#how에 'inner'를 넘기면 Cartesian_product(데카르트 곱)을 반환
pd.merge(df1,df2,how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

In [21]:
left = DataFrame({'key1':['foo','foo','bar'],
                  'key2':['one','two','one'],
                  'lval':[1,2,3]})

In [22]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [23]:
right = DataFrame({'key1':['foo','foo','bar','bar'],
                  'key2':['one','one','one','two'],
                  'rval':[4,5,6,7]})

In [24]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [25]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2   NaN
3  bar  one     3     6
4  bar  two   NaN     7

In [26]:
pd.merge(left,right,on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [27]:
#suffixes는 column이름뒤에 붙일 문자열의 튜플
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

###7.1.2 색인 머지하기
- 머지하려는 키가 DataFrame의 색인일 수 있다. 이럴경우 left_index=True,right_index=True 옵션을 지정

In [28]:
left1= DataFrame({'key':['a','b','a','a','b','c'],
                  'value':range(6)})

In [29]:
right1 = DataFrame({'group_val':[3.5,7]}, index=['a','b'])

In [30]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [31]:
right1

   group_val
a        3.5
b        7.0

In [32]:
#left의 column이 right의 index로 join할때
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [33]:
#how에 'outer'인자를 넘겨서 교집합이 아닌 합집합을 구할 수도 있다.
pd.merge(left1,right1,left_on='key',right_index=True,how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [34]:
lefth = DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],
                   'key2':[2000,2001,2002,2001,2002],
                   'data':np.arange(5.)})

In [35]:
righth = DataFrame(np.arange(12).reshape(6,2),
                   index=[['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],
                          [2001,2000,2000,2000,2001,2002]],
                   columns=['event1','event2'])

In [36]:
lefth

   data    key1  key2
0     0    Ohio  2000
1     1    Ohio  2001
2     2    Ohio  2002
3     3  Nevada  2001
4     4  Nevada  2002

In [37]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [38]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

   data    key1  key2  event1  event2
0     0    Ohio  2000       4       5
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1

In [39]:
left2 = DataFrame([[1.,2.],[3.,4.],[5.,6.]],index=['a','c','e'],columns=['Ohio','Nevada'])

In [40]:
right2 = DataFrame([[7.,8.],[9.,10.],[11.,12.],[13,14]],
                   columns=['Missouri','Alabama'],
                   index=['b','c','d','e'])

In [41]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [42]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [43]:
#기존의 merge는 같은 column을 구했지만 left_index,right_index를 옵션으로 하면 같은 index를 merge함
pd.merge(left2,right2,left_index=True,right_index=True)

   Ohio  Nevada  Missouri  Alabama
c     3       4         9       10
e     5       6        13       14

In [44]:
pd.merge(left2,right2,how='outer',left_index=True,right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
b   NaN     NaN         7        8
c     3       4         9       10
d   NaN     NaN        11       12
e     5       6        13       14

- 색인으로 merge 할 경우, DataFrame의 join 메서드를 사용하는 것이 좋다.
- join 메서드는 column이 겹치지 않으며 완전히 같거나 유사한 색인 구조를 가진 여러개의 DataFrame 객체를 병합할때 사용할 수 있다.

In [45]:
#만약 left에 해당하는 index가 right에 없다면 NaN으로 처리
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
c     3       4         9       10
e     5       6        13       14

In [46]:
left2.join(right2,how='outer')

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
b   NaN     NaN         7        8
c     3       4         9       10
d   NaN     NaN        11       12
e     5       6        13       14

In [47]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [48]:
right1

   group_val
a        3.5
b        7.0

In [49]:
left1.join(right1,on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [50]:
another = DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],
                    index = ['a','c','e','f'],
                    columns = ['New York','Orgon'])

In [51]:
another

   New York  Orgon
a         7      8
c         9     10
e        11     12
f        16     17

In [52]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [53]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [54]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Orgon
a     1       2       NaN      NaN         7      8
c     3       4         9       10         9     10
e     5       6        13       14        11     12

In [55]:
left2.join([right2,another],how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Orgon
a     1       2       NaN      NaN         7      8
b   NaN     NaN         7        8       NaN    NaN
c     3       4         9       10         9     10
d   NaN     NaN        11       12       NaN    NaN
e     5       6        13       14        11     12
f   NaN     NaN       NaN      NaN        16     17

###7.1.3 축 따라 이어붙이기

- 데이터를 합치는 다른 방법으로는 concatenation(이어붙이기), binding(연결), stacking(적층) 등이 있다
- NumPy는 ndarray를 연결하는 concatenate 함수를 제공한다.

In [56]:
arr = np.arange(12).reshape(3,4)

In [57]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [58]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [59]:
#concatenate의 default옵션은 axis=0(세로로 이어붙이기)
np.concatenate([arr,arr])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [60]:
s1 = Series([0,1],index=['a','b'])

In [61]:
s2 = Series([2,3,4],index=['c','d','e'])

In [62]:
s3 = Series([5,6],index=['f','g'])

In [63]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [64]:
#axis=1 은 column을 의미
pd.concat([s1,s2,s3],axis=1)

    0   1   2
a   0 NaN NaN
b   1 NaN NaN
c NaN   2 NaN
d NaN   3 NaN
e NaN   4 NaN
f NaN NaN   5
g NaN NaN   6

In [65]:
s4 = pd.concat([s1*5,s3])

In [66]:
s4

a    0
b    5
f    5
g    6
dtype: int64

In [67]:
s1

a    0
b    1
dtype: int64

In [68]:
pd.concat([s1,s4],axis=1)

    0  1
a   0  0
b   1  5
f NaN  5
g NaN  6

In [69]:
pd.concat([s1,s4],axis=1,join='inner')

   0  1
a  0  0
b  1  5

In [70]:
pd.concat([s1,s4],axis=1,join_axes=[['a','c','b','e']])
#join_axes에 list에 list형태인 이유?????????

    0   1
a   0   0
c NaN NaN
b   1   5
e NaN NaN

In [71]:
s1

a    0
b    1
dtype: int64

In [72]:
s3

f    5
g    6
dtype: int64

In [73]:
result = pd.concat([s1, s1,s3],keys=['one','two','three'])

In [74]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [75]:
result.unstack()

        a   b   f   g
one     0   1 NaN NaN
two     0   1 NaN NaN
three NaN NaN   5   6

In [76]:
print s1
print s2
print s3

a    0
b    1
dtype: int64
c    2
d    3
e    4
dtype: int64
f    5
g    6
dtype: int64

In [77]:
#Series는 axis=1로 병합할 경우 keys는 DataFrame의 column 제목이 된다.
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'])

   one  two  three
a    0  NaN    NaN
b    1  NaN    NaN
c  NaN    2    NaN
d  NaN    3    NaN
e  NaN    4    NaN
f  NaN  NaN      5
g  NaN  NaN      6

In [78]:
df1 = DataFrame(np.arange(6).reshape(3,2), index=['a','b','c'],columns=['one','two'])

In [79]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [80]:
df2 = DataFrame(5+np.arange(4).reshape(2,2), index=['a','c'], columns=['three','four'])

In [81]:
df2

   three  four
a      5     6
c      7     8

In [82]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'])

  level1     level2
     one two  three four
a      0   1      5    6
b      2   3    NaN  NaN
c      4   5      7    8

In [83]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'])

  level1     level2
     one two  three four
a      0   1      5    6
b      2   3    NaN  NaN
c      4   5      7    8

In [84]:
pd.concat({'level1':df1,'level2':df2},axis=1)

  level1     level2
     one two  three four
a      0   1      5    6
b      2   3    NaN  NaN
c      4   5      7    8

In [85]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],names=['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1      5    6
b          2   3    NaN  NaN
c          4   5      7    8

In [86]:
df1 = DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])

In [87]:
df2 = DataFrame(np.random.randn(2,3),columns=['b','d','a'])

In [88]:
df1

          a         b         c         d
0 -0.348926 -0.534222  1.109518  0.187792
1 -1.391824 -1.487688  0.013581 -1.043758
2 -0.701250 -0.206718 -0.735384  0.592423

In [89]:
df2

          b         d         a
0 -0.341530 -0.897478 -0.218110
1 -0.875802 -0.455382  0.053826

In [90]:
pd.concat([df1,df2])

          a         b         c         d
0 -0.348926 -0.534222  1.109518  0.187792
1 -1.391824 -1.487688  0.013581 -1.043758
2 -0.701250 -0.206718 -0.735384  0.592423
0 -0.218110 -0.341530       NaN -0.897478
1  0.053826 -0.875802       NaN -0.455382

In [91]:
#ignore_index는 로우색인이 필요없는 경우 사용
pd.concat([df1,df2],ignore_index=True)

          a         b         c         d
0 -0.348926 -0.534222  1.109518  0.187792
1 -1.391824 -1.487688  0.013581 -1.043758
2 -0.701250 -0.206718 -0.735384  0.592423
3 -0.218110 -0.341530       NaN -0.897478
4  0.053826 -0.875802       NaN -0.455382

###7.1.4 겹치는 데이터 합치기

In [92]:
a = Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
           index=['f','e','d','c','b','a'])

In [93]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [94]:
b = Series(np.arange(len(a),dtype=np.float64),
            index=['f','e','d','c','b','a'])

In [95]:
b[-1] = np.nan

In [96]:
b

f     0
e     1
d     2
c     3
b     4
a   NaN
dtype: float64

In [97]:
#numpy.where 함수는 'x if 조건 else y' 같은 삼항식의 벡터화된 버전(조건,참,거짓)
np.where(pd.isnull(a),b,a)

array([ 0. ,  2.5,  2. ,  3.5,  4.5,  nan])

In [98]:
pd.isnull(a)

f     True
e    False
d     True
c    False
b    False
a     True
dtype: bool

In [99]:
b

f     0
e     1
d     2
c     3
b     4
a   NaN
dtype: float64

In [100]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [101]:
#b[:-2]에 a[2:]를 combine
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [102]:
df1 = DataFrame({'a':[1.,np.nan,5.,np.nan],
                 'b':[np.nan,2.,np.nan,6.],
                 'c':range(2,18,4)})

In [103]:
df2 = DataFrame({'a':[5.,4.,np.nan,3.,7.],
                 'b':[np.nan,3.,4.,6.,8.]})

In [104]:
print df1
print
print df2

    a   b   c
0   1 NaN   2
1 NaN   2   6
2   5 NaN  10
3 NaN   6  14

    a   b
0   5 NaN
1   4   3
2 NaN   4
3   3   6
4   7   8

In [105]:
df1.combine_first(df2)

   a   b   c
0  1 NaN   2
1  4   2   6
2  5   4  10
3  3   6  14
4  7   8 NaN

##7.2 재형성과 피벗
- 표 형식의 데이터를 재배치하는 다양한 연산을 **재형성** 이라고 함

###7.2.1 계층적 색인으로 재형성하기
- stack : 데이터의 column을 row로 피벗(회전)
- unstack : 데이터의 row를 column으로 피벗(회전)

In [106]:
data = DataFrame(np.arange(6).reshape(2,3),
                 index=pd.Index(['Ohio','Colorado'],name='state'),
                 columns=pd.Index(['one','two','three'],name='number'))

In [107]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [108]:
#data의 column을 row로 피벗
result = data.stack()

In [109]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [110]:
#result의 column을 row로 피벗
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [111]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [112]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [113]:
s1 = Series([0,1,2,3],index=['a','b','c','d'])

In [114]:
s2 = Series([4,5,6],index=['c','d','e'])

In [115]:
print s1
print s2

a    0
b    1
c    2
d    3
dtype: int64
c    4
d    5
e    6
dtype: int64

In [116]:
data2 = pd.concat([s1,s2],keys=['one','two'])

In [117]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [118]:
data2.unstack()

      a   b  c  d   e
one   0   1  2  3 NaN
two NaN NaN  4  5   6

In [119]:
data2.unstack().stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: float64

In [120]:
data2.unstack().stack(dropna=False)

one  a     0
     b     1
     c     2
     d     3
     e   NaN
two  a   NaN
     b   NaN
     c     4
     d     5
     e     6
dtype: float64

In [121]:
df = DataFrame({'left':result,'right':result+5},
              columns=pd.Index(['left','right'],name='side'))

In [122]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [123]:
#row의 'state'를 column으로 피벗
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [124]:
#column의 'side'를 row로 피벗
df.unstack('state').stack('side')

state         Ohio  Colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

###7.2.2 피버팅으로 데이터 나열 방식 바꾸기

In [125]:
ldata = pd.read_csv('ex_7_2_2.txt',header=None,names=['date','time','item','value'])

In [126]:
ldata[:10]

         date      time     item     value
0  1959-03-31  00:00:00  realgdp  2710.349
1  1959-03-31  00:00:00     infl     0.000
2  1959-03-31  00:00:00    unemp     5.800
3  1959-06-30  00:00:00  realgdp  2778.801
4  1959-06-30  00:00:00     infl     2.340
5  1959-06-30  00:00:00    unemp     5.100
6  1959-09-30  00:00:00  realgdp  2775.488
7  1959-09-30  00:00:00     infl     2.740
8  1959-09-30  00:00:00    unemp     5.300
9  1959-12-31  00:00:00  realgdp  2785.204

In [127]:
#pivot(index,column,표현하고 싶은 데이터)
pivoted = ldata.pivot('date','item','value')

In [128]:
pivoted.head()

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31   NaN  2785.204    NaN

In [129]:
ldata

         date      time     item     value
0  1959-03-31  00:00:00  realgdp  2710.349
1  1959-03-31  00:00:00     infl     0.000
2  1959-03-31  00:00:00    unemp     5.800
3  1959-06-30  00:00:00  realgdp  2778.801
4  1959-06-30  00:00:00     infl     2.340
5  1959-06-30  00:00:00    unemp     5.100
6  1959-09-30  00:00:00  realgdp  2775.488
7  1959-09-30  00:00:00     infl     2.740
8  1959-09-30  00:00:00    unemp     5.300
9  1959-12-31  00:00:00  realgdp  2785.204

In [130]:
ldata['value2'] = np.random.randn(len(ldata))

In [131]:
ldata[:10]

         date      time     item     value    value2
0  1959-03-31  00:00:00  realgdp  2710.349 -0.336259
1  1959-03-31  00:00:00     infl     0.000 -0.313821
2  1959-03-31  00:00:00    unemp     5.800 -0.573514
3  1959-06-30  00:00:00  realgdp  2778.801 -1.075828
4  1959-06-30  00:00:00     infl     2.340 -0.963371
5  1959-06-30  00:00:00    unemp     5.100  0.648865
6  1959-09-30  00:00:00  realgdp  2775.488 -0.302090
7  1959-09-30  00:00:00     infl     2.740 -2.474817
8  1959-09-30  00:00:00    unemp     5.300  1.588355
9  1959-12-31  00:00:00  realgdp  2785.204 -0.550924

In [132]:
#date를 row, item을 column으로
pivoted = ldata.pivot('date','item')

In [133]:
pivoted[:5]

                time                     value                    value2  \
item            infl   realgdp     unemp  infl   realgdp unemp      infl
date
1959-03-31  00:00:00  00:00:00  00:00:00  0.00  2710.349   5.8 -0.313821
1959-06-30  00:00:00  00:00:00  00:00:00  2.34  2778.801   5.1 -0.963371
1959-09-30  00:00:00  00:00:00  00:00:00  2.74  2775.488   5.3 -2.474817
1959-12-31       NaN  00:00:00       NaN   NaN  2785.204   NaN       NaN


item         realgdp     unemp
date
1959-03-31 -0.336259 -0.573514
1959-06-30 -1.075828  0.648865
1959-09-30 -0.302090  1.588355
1959-12-31 -0.550924       NaN

In [134]:
pivoted['value'][:5]

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31   NaN  2785.204    NaN

In [135]:
ldata

         date      time     item     value    value2
0  1959-03-31  00:00:00  realgdp  2710.349 -0.336259
1  1959-03-31  00:00:00     infl     0.000 -0.313821
2  1959-03-31  00:00:00    unemp     5.800 -0.573514
3  1959-06-30  00:00:00  realgdp  2778.801 -1.075828
4  1959-06-30  00:00:00     infl     2.340 -0.963371
5  1959-06-30  00:00:00    unemp     5.100  0.648865
6  1959-09-30  00:00:00  realgdp  2775.488 -0.302090
7  1959-09-30  00:00:00     infl     2.740 -2.474817
8  1959-09-30  00:00:00    unemp     5.300  1.588355
9  1959-12-31  00:00:00  realgdp  2785.204 -0.550924

In [136]:
#index에 있던 'item'을 column으로 피벗
unstacked = ldata.set_index(['date','item']).unstack('item')

In [137]:
unstacked[:7]

                time                     value                    value2  \
item            infl   realgdp     unemp  infl   realgdp unemp      infl
date
1959-03-31  00:00:00  00:00:00  00:00:00  0.00  2710.349   5.8 -0.313821
1959-06-30  00:00:00  00:00:00  00:00:00  2.34  2778.801   5.1 -0.963371
1959-09-30  00:00:00  00:00:00  00:00:00  2.74  2775.488   5.3 -2.474817
1959-12-31       NaN  00:00:00       NaN   NaN  2785.204   NaN       NaN


item         realgdp     unemp
date
1959-03-31 -0.336259 -0.573514
1959-06-30 -1.075828  0.648865
1959-09-30 -0.302090  1.588355
1959-12-31 -0.550924       NaN

##7.3 데이터 변형

###7.3.1 중복 제거하기

In [138]:
data = DataFrame({'k1':['one']*3+['two']*4,
                 'k2':[1,1,2,3,3,4,4]})

In [139]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [140]:
#duplicated 메서드는 각 row가 중복인지 아닌지를 알려주는 boolean Series객체 반환
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [141]:
#drop_duplicates는 duplicated 배열이 False(중복된것을 제거한)인 DataFrame을 반환한다.
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [142]:
#'v1' column 새로 생성
data['v1'] = range(7)

In [143]:
#drop_duplicates에 중복기준을 정할 수 있음
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [144]:
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [145]:
#duplicated 와 drop_duplicates는 기본적으로 처음 발견된 값을 유지하는데,
#take_last=True 옵션을 통해 마지막으로 발견된 값을 반환할 수 있다.
data.drop_duplicates(['k1','k2'], take_last=True)

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

###7.3.2 함수나 매칭 이용하여 데이터 변형하기

In [146]:
data = DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
                 'ounces': [4,3,12,6,7.5,8,3,5,6]})

In [147]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [148]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [149]:
#'food' column을 전부 소문자로 변경한 뒤, meat_to_animal과 mapping
data['animal']=data['food'].map(str.lower).map(meat_to_animal)

In [150]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [151]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

###7.3.3 값 치환하기

In [152]:
#fillna 메서드를 사용해서 누락된 값 채우기
data = Series([1.,-999.,2.,-999.,-1000.,3.])

In [153]:
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: float64

In [154]:
#replace 메서드를 통해 특정 값을 NaN으로 치환할 수 있다.
data.replace(-999,np.nan)

0       1
1     NaN
2       2
3     NaN
4   -1000
5       3
dtype: float64

In [155]:
data.replace([-999,-1000],np.nan)

0     1
1   NaN
2     2
3   NaN
4   NaN
5     3
dtype: float64

In [156]:
data.replace([-999,-1000],[np.nan,0])

0     1
1   NaN
2     2
3   NaN
4     0
5     3
dtype: float64

In [157]:
#리스트 대신 사전을 이용해도 됨
data.replace({-999:np.nan,-1000:0})

0     1
1   NaN
2     2
3   NaN
4     0
5     3
dtype: float64

###7.3.4 축 색인 이름 바꾸기

In [158]:
data = DataFrame(np.arange(12).reshape(3,4),
                index=['Ohio','Colorado','New York'],
                columns=['one','two','three','four'])

In [159]:
data.index.map(str.upper)

array(['OHIO', 'COLORADO', 'NEW YORK'], dtype=object)

In [160]:
data.index = data.index.map(str.upper)

In [161]:
data.index

Index([u'OHIO', u'COLORADO', u'NEW YORK'], dtype='object')

In [162]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [163]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [164]:
#축 이름 중 일부만 변경하는 것도 가능
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [165]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [166]:
#원본 데이터를 바로 변경하려면 inplace = True 옵션
_ = data.rename(index={'OHIO':'INDIANA'},inplace=True)

In [167]:
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

###7.3.5 개별화와 양자화

In [168]:
ages = [17,20,22,25,27,21,23,37,61,45,41,32,102]

In [169]:
bins = [18,25,35,60,100]

In [170]:
#pandas의 cut함수는 1번째 인자의 값들이 2번째 인자로 들어온 값을 범위로 하여 어느 범위에 속하는지 알려준다.
#해당 범위에 존재하지않는 수는 NaN으로 처리
#pandas.cut(값,범위)
cats = pd.cut(ages,bins)

In [171]:
cats

[NaN, (18, 25], (18, 25], (18, 25], (25, 35], ..., (60, 100], (35, 60], (35, 60], (25, 35], NaN]
Length: 13
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [172]:
type(cats)

pandas.core.categorical.Categorical

In [173]:
#Categorical 객체인 cats
#cats의 범위 안에있으면 index로, 없으면 -1
cats.codes

array([-1,  0,  0,  0,  1,  0,  0,  2,  3,  2,  2,  1, -1], dtype=int8)

In [174]:
#Categorical.levels는 범위가 담긴 객체
cats.categories

Index([u'(18, 25]', u'(25, 35]', u'(35, 60]', u'(60, 100]'], dtype='object')

In [175]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     2
(60, 100]    1
dtype: int64

In [176]:
#'()'는 포함 X, '[]'는 포함 O
#보통은 '(]'(~초과 ~이하)로 나타내는데 right=False를 하면 '[)'(~이상 ~미만)로 표현가능 )
pd.cut(ages,[18,26,36,61,100],right=False)

[NaN, [18, 26), [18, 26), [18, 26), [26, 36), ..., [61, 100), [36, 61), [36, 61), [26, 36), NaN]
Length: 13
Categories (4, object): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [177]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [178]:
#labels 옵션으로 그룹의 이름을 직접 넘겨줄 수도 있다.
pd.cut(ages,bins,labels=group_names)

[NaN, Youth, Youth, Youth, YoungAdult, ..., Senior, MiddleAged, MiddleAged, YoungAdult, NaN]
Length: 13
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [179]:
data = np.random.rand(20)

In [180]:
data

array([ 0.12621473,  0.20542788,  0.20956639,  0.72542534,  0.9123265 ,
        0.18491869,  0.61960907,  0.24922935,  0.68814163,  0.97089469,
        0.61650186,  0.24512356,  0.19059943,  0.95208198,  0.98648392,
        0.42439846,  0.56443501,  0.85326222,  0.03678756,  0.14197292])

In [181]:
#precision은 클수록 정밀도가 커짐
pd.cut(data,4,precision=2)

[(0.036, 0.27], (0.036, 0.27], (0.036, 0.27], (0.51, 0.75], (0.75, 0.99], ..., (0.27, 0.51], (0.51, 0.75], (0.75, 0.99], (0.036, 0.27], (0.036, 0.27]]
Length: 20
Categories (4, object): [(0.036, 0.27] < (0.27, 0.51] < (0.51, 0.75] < (0.75, 0.99]]

In [182]:
data = np.random.randn(1000) #Normally distributed

In [183]:
data

array([ -2.30929057e-01,  -3.20654368e-01,   1.14333412e-01,
        -4.25213448e-01,  -1.13851419e+00,   1.29788862e+00,
        -3.35528404e-01,   5.05866235e-03,  -3.99650625e-01,
        -8.09961251e-01,   2.22298384e-01,  -1.74486661e+00,
         8.18680468e-01,   6.89202970e-02,   1.05178741e+00,
         1.65946669e+00,   2.20716239e-01,  -5.78640470e-01,
         6.93288844e-01,  -5.58260913e-01,  -1.24594146e-01,
        -2.19392062e-01,   9.83787648e-01,   9.98933914e-01,
         4.78125425e-01,   3.70563126e-01,  -6.57157455e-01,
         2.68442091e-01,   9.11583587e-01,  -3.81704192e-01,
        -1.39691844e-01,  -4.79695007e-01,   6.41732041e-01,
         9.32003123e-01,  -3.91565736e-01,  -7.56079423e-01,
        -4.05981121e-01,  -5.36828023e-01,   9.34090816e-01,
        -1.65981184e+00,  -3.61521145e-01,   9.81286819e-01,
        -4.22271523e-01,   2.12732513e-01,  -1.19632204e+00,
        -9.90373017e-01,   1.11232846e-01,  -7.95514039e-01,
         1.55304213e-01,   1.75516671e-01,  -7.05223261e-01,
         1.33025877e-01,  -7.47814170e-01,   4.59649828e-01,
         6.68049658e-01,  -9.85753812e-01,  -8.43568816e-01,
         1.09780154e+00,  -1.88116181e-01,  -2.11595291e+00,
         7.19704138e-01,  -1.73703710e-01,  -7.11799001e-03,
         9.22885863e-01,   3.19457258e-01,   1.35102013e-01,
        -1.15052018e+00,  -3.76851707e-01,  -4.37994695e-01,
        -1.76023229e+00,   4.25255206e-01,  -7.28442803e-01,
         6.33644712e-01,   6.98447060e-01,  -2.97790813e-01,
        -1.10947974e+00,  -2.39796767e+00,   4.86873469e-01,
         8.46437405e-01,  -4.63716881e-01,  -4.03871327e-01,
         1.35157177e+00,  -1.99336608e-01,   1.22998892e+00,
         3.19264290e-02,   8.42916633e-01,   1.37195895e+00,
        -5.92051229e-01,  -5.65734071e-01,   3.04200053e-01,
        -7.53699427e-02,  -3.15619916e-01,  -1.13544939e+00,
         9.58594186e-02,   1.20102308e+00,  -2.11718127e+00,
         1.03794119e+00,  -3.86021424e-01,  -3.29113590e-01,
         5.15740921e-01,   2.55170751e-01,  -1.75153153e-01,
        -6.12195150e-02,  -4.24863055e-02,  -8.74691133e-01,
        -1.66109739e-01,  -2.14092258e+00,   1.09431481e+00,
        -1.13730134e+00,   1.71615832e-01,  -7.88947530e-01,
         8.69360481e-01,   4.74242185e-01,  -1.11786437e+00,
         1.55549655e+00,  -9.56518808e-01,  -8.08062300e-01,
        -2.09656153e+00,   6.57682562e-01,   4.56160788e-01,
         3.09813360e-01,  -1.71336681e+00,   3.62511994e-01,
         8.31543560e-01,  -2.53215991e-02,  -1.36095817e+00,
        -2.60898222e-01,  -8.28391068e-03,  -3.05109056e-01,
         1.38913310e+00,   3.51432117e-02,  -1.13750188e+00,
        -4.34800347e-02,   6.19478891e-01,   1.20650054e+00,
         7.75950993e-01,  -8.25428793e-01,   3.20650488e-01,
         1.21134455e+00,  -5.44966678e-02,  -6.56852156e-01,
        -1.76007359e+00,   7.93036343e-02,  -9.84937654e-01,
        -1.61870938e+00,   1.21119093e-02,  -5.52330149e-01,
         2.10956814e-01,   3.78053276e-01,  -1.56893268e+00,
         3.39022957e-03,  -1.09791593e+00,  -1.54266780e+00,
         1.02780034e+00,   1.14039992e+00,  -1.76968536e+00,
        -1.76093521e+00,  -4.99682973e-01,   1.37016721e+00,
        -3.35081008e-01,   7.76640527e-02,   5.58608515e-01,
        -8.06960489e-01,   2.89544974e-01,   3.36477006e-01,
        -1.48708993e+00,   1.41347388e+00,   1.16693171e-02,
        -3.40813469e-02,  -3.40580194e-01,   1.97804053e+00,
        -1.22373639e+00,   9.73382262e-02,  -3.93160672e-01,
        -4.02841962e-01,   1.68012577e+00,   1.19900766e+00,
        -8.47877541e-01,  -5.34581934e-01,  -6.05768075e-01,
        -1.10295169e+00,  -2.82419313e+00,   6.95600307e-01,
         5.07562390e-01,   1.68259733e-01,   1.18504466e+00,
        -4.68902510e-01,   1.45236300e+00,  -1.11409259e+00,
         7.12155460e-01,   2.25069407e-01,   1.71420144e+00,
         8.86291550e-01,  -1.46227244e+00,   1.36553795e+00,
        -1.08071652e+00,   3.67434304e-01,   4.69392682e-01,
        -5.76595380e-01,  -1.99357764e+00,  -1.90277781e+00,
         1.39915148e+00,   1.44799526e+00,   1.84679370e+00,
        -9.32331296e-01,  -3.08059105e-01,   1.73385135e+00,
         7.03433803e-01,  -1.06418565e+00,  -4.85831389e-01,
        -2.40512548e-01,   1.90859860e+00,   1.60855089e+00,
         1.11151590e+00,   5.88830134e-02,  -4.72532454e-01,
         9.60055657e-01,   1.37541366e-01,  -1.07220510e-01,
         2.97049166e-01,   1.00177944e+00,   1.73225245e+00,
         1.65060301e+00,  -6.57433040e-01,   6.28794682e-01,
         7.83872019e-02,   1.53540136e+00,   1.97362798e-01,
        -7.13351442e-01,  -2.77043955e-01,  -2.56549191e-01,
         2.73193532e-02,   1.75028731e+00,  -3.52255612e-01,
        -1.91190753e+00,   7.13152489e-01,  -6.81370085e-01,
        -1.22782645e+00,   1.28808455e-01,  -1.24693082e-01,
        -1.47215528e+00,   3.13269863e-01,  -8.57742313e-02,
         1.87613391e-01,  -2.74086225e+00,  -1.03063139e+00,
        -1.35180997e+00,   1.00256144e+00,   9.24451145e-02,
         8.09562058e-01,  -1.23133585e+00,  -1.62075524e+00,
         3.95714142e-01,   3.92543646e-01,  -7.76720361e-01,
        -4.02290753e-01,   2.34071067e+00,   1.42705564e+00,
        -2.21743006e+00,   1.00822157e+00,  -2.20794302e-01,
        -1.43214449e+00,  -4.38021238e-01,  -9.10668842e-01,
         2.56086131e-01,   1.33880876e+00,  -1.13643085e+00,
         6.01946653e-01,   2.93035621e-01,  -1.91708410e+00,
        -7.31111547e-01,   6.61342319e-01,  -6.95775399e-01,
        -2.11959609e-01,   1.58787251e+00,   3.13177990e-02,
        -8.45496524e-01,   9.89515877e-01,   1.48090310e+00,
        -4.93542817e-01,  -1.67142743e+00,  -8.52672116e-01,
        -5.99381701e-01,   9.13428107e-01,  -5.65832959e-02,
         1.40378376e+00,   3.64286384e-01,   1.19656379e+00,
        -8.14110310e-01,  -1.12297730e+00,   1.77778120e-01,
         1.94743435e+00,   4.67565316e-01,  -8.76996701e-01,
        -8.28793590e-01,   2.06412578e-01,  -1.15609859e+00,
        -1.15858039e+00,  -1.78069304e+00,  -5.20542508e-01,
         4.81179276e-01,  -4.92177513e-01,   1.13581423e+00,
        -1.58825331e+00,   1.11288876e+00,  -2.02768609e+00,
        -1.34582530e-01,  -2.29851586e+00,  -1.22524355e+00,
        -1.11394108e+00,   4.20103353e-01,  -8.17420170e-01,
         6.91602272e-01,  -1.73663691e+00,   1.83711642e+00,
        -1.60271884e+00,   3.19693453e-01,   1.34789918e+00,
         4.53904183e-01,  -4.22197989e-01,  -1.34859016e+00,
        -1.38425896e+00,   7.59726313e-01,   8.23459971e-01,
         8.81269544e-02,  -5.57945085e-01,   2.09090688e+00,
        -1.28842255e+00,  -1.77039804e+00,  -2.33776017e+00,
         1.17171407e+00,  -6.76477731e-01,  -1.18263674e+00,
        -1.02581080e+00,  -2.35355042e-01,  -1.77231401e+00,
         1.32237241e+00,  -2.08307447e+00,  -5.45266470e-01,
         1.84335719e-01,   1.93181047e+00,  -2.00972521e+00,
         8.92524571e-03,   6.85532539e-02,   7.29749722e-01,
        -1.29506284e+00,  -9.43328544e-02,   2.01529914e+00,
         8.80052995e-01,   1.42080231e+00,   5.05814888e-01,
         4.93720921e-01,   1.03600597e+00,  -3.70486896e-01,
         1.17751120e+00,  -8.35074322e-02,  -1.32935957e+00,
         1.10812732e+00,   1.32150071e+00,  -1.67791994e+00,
        -6.89504368e-01,   1.91052566e-01,   6.06401541e-01,
        -2.69230261e+00,  -1.68604938e+00,  -1.30212300e+00,
         1.53737973e+00,  -1.36018023e+00,   2.89224826e-01,
        -7.59318157e-01,   3.29384385e-01,  -9.33055845e-01,
         5.42573442e-02,  -6.03377174e-01,  -5.59654973e-01,
        -9.49933275e-02,   3.39796440e-01,  -3.46453629e-01,
        -3.04190385e-01,   2.77169494e-01,   2.82241297e-01,
         1.20454945e+00,   8.06948675e-02,  -1.35970022e+00,
         6.25382437e-01,   2.34286400e+00,   8.89323308e-02,
         5.94903665e-01,   1.86122696e+00,  -3.87477971e-01,
        -1.35239525e+00,   8.97331304e-01,   1.31005846e+00,
         1.61148339e-01,   1.17384968e+00,   9.55828029e-01,
        -1.15861193e-01,   1.14795767e-01,   6.67946903e-01,
         9.50328583e-01,   3.47543935e-01,   9.92617105e-01,
         5.08638093e-01,   1.10970526e+00,   1.15917580e+00,
        -6.15472778e-01,   1.75239095e-01,   9.31178724e-01,
        -7.18506528e-01,  -1.11426198e+00,  -7.15344839e-02,
        -5.53273567e-01,  -8.52790693e-02,  -7.53608040e-01,
        -5.55619326e-03,  -1.58420128e-01,   1.62189770e+00,
         2.75486497e-01,  -6.39134394e-01,   6.72468177e-01,
         1.73294591e+00,  -2.22671988e+00,  -1.61065779e-01,
         2.66503221e-03,   6.60533027e-01,  -8.97940215e-01,
         9.80712332e-01,   1.08636637e+00,   6.08123275e-01,
         5.63811425e-01,  -1.93294777e-02,  -1.35687039e+00,
         2.41643340e+00,   4.28456696e-01,   4.03895835e-01,
         3.15940626e-01,   1.70591509e-01,  -2.98709643e-01,
         1.64205034e+00,  -1.21134909e-01,   6.69156186e-01,
        -5.07105804e-01,   8.89168084e-01,   2.65895147e-01,
         1.76515003e-01,   7.62133797e-02,  -6.40863123e-01,
         2.42079882e+00,   7.56606164e-01,  -1.27641659e+00,
         1.36042860e+00,  -1.48558831e+00,   1.01478439e+00,
         1.23046957e+00,   1.70364975e+00,  -5.61894822e-01,
        -5.46208073e-01,  -1.09304007e-01,  -6.58570726e-01,
         6.82831735e-01,   6.11873257e-01,  -7.32337336e-01,
         8.05299599e-01,   2.95384262e-01,  -6.47412631e-01,
        -5.41936441e-01,  -4.47354994e-01,  -1.61498353e+00,
         6.64006359e-01,   5.04813446e-01,  -6.93173943e-01,
        -6.70877826e-01,   9.82351009e-01,   1.08970342e+00,
         3.68724651e-01,   4.88072186e-02,   1.61830784e+00,
        -8.31281390e-02,  -3.19763258e-02,   5.32036895e-01,
         2.03365390e+00,  -9.33542771e-01,   4.61739143e-01,
         9.96051286e-01,  -4.34192067e-01,  -2.61955994e-01,
        -7.86198526e-01,   1.93213040e-01,   8.17137304e-01,
         5.31065340e-01,  -1.07328783e+00,  -2.33894897e+00,
         6.19244271e-02,   5.43871954e-01,   1.04341547e+00,
         3.74951045e-01,  -6.84471166e-01,   4.51809790e-01,
         1.69983513e+00,  -2.27687991e-01,   9.71094958e-01,
        -1.14129709e+00,   3.05450578e-02,  -1.07101931e+00,
        -8.91768479e-01,   3.70637663e-01,  -8.00843073e-01,
         9.47698436e-02,  -2.25974416e+00,  -7.84359759e-01,
        -1.34536743e+00,   2.52874481e-01,   1.29103552e+00,
         6.63661120e-01,  -2.74940310e-01,   1.10777665e+00,
        -4.52087087e-01,  -8.66847892e-03,  -2.23260518e-01,
        -1.54627734e+00,   8.55082549e-01,   7.87566245e-01,
        -3.88883849e-01,   1.42122537e+00,   1.19784221e+00,
        -7.92062652e-01,   9.87733753e-01,  -7.10015771e-01,
        -1.99329558e+00,   1.75693883e-01,  -6.32819414e-01,
        -6.72485833e-01,   4.28860641e-01,   4.17774934e-01,
         8.74297860e-01,  -5.68715322e-01,  -3.70321820e-01,
        -1.12054014e+00,   8.44133725e-01,  -8.92969131e-01,
        -5.44238497e-01,   2.65330672e-01,   1.71334201e-01,
        -1.26695815e+00,  -1.01720300e+00,   4.76696684e-01,
         1.78654008e+00,   1.08467331e+00,  -4.37808927e-01,
         4.51314467e-01,   3.59973375e-02,   1.86028932e+00,
        -2.13826421e+00,   2.38612936e-02,   1.99048404e-01,
        -1.98086462e-01,   1.24726554e+00,   7.97550826e-01,
         1.17548673e+00,  -1.26127259e+00,   8.90191283e-01,
        -1.81279753e-01,  -1.46289926e-01,  -1.27258259e+00,
        -6.67364074e-01,  -1.29454404e+00,   5.57231300e-01,
         4.72724730e-01,  -7.00935277e-01,  -1.14347738e+00,
         1.84793113e+00,  -8.07668521e-02,   4.82476782e-01,
         1.71314722e-01,  -4.72098045e-01,   7.82460749e-01,
         2.22713765e+00,  -1.03412666e+00,  -9.74422091e-01,
         4.51619181e-01,  -5.57261486e-01,   2.53125701e-01,
         1.24581854e+00,   6.56162319e-01,  -7.36541077e-01,
         3.01443868e-01,   6.62111662e-01,   1.40569317e+00,
         1.19428220e+00,  -4.30956338e-01,   1.08770639e+00,
         1.60871295e+00,  -7.64287539e-01,   1.06643359e+00,
         9.21195918e-01,   1.14850871e+00,   5.33700623e-01,
        -1.24511836e+00,  -2.80812827e-01,   2.80630444e-01,
        -5.39841701e-01,  -3.80331952e-01,   2.02077416e+00,
        -5.58190876e-01,  -1.59055634e+00,   7.73885742e-01,
         7.13832722e-01,  -8.14962940e-01,   1.46131468e+00,
        -3.64455647e-01,  -1.16036776e-01,   1.26862077e-01,
         1.54793088e+00,  -8.40398244e-01,  -6.74248910e-01,
         2.65082431e-01,  -5.92146021e-01,   1.09498467e-01,
        -2.59238718e-01,   5.32686241e-01,  -7.32371147e-01,
         1.28762488e+00,  -1.52727756e+00,  -3.60816279e-01,
        -3.32154387e-01,   1.26261378e+00,  -2.55972394e-01,
        -7.10352449e-01,  -6.64272691e-01,   8.10114705e-01,
        -9.16671677e-01,  -1.31427820e+00,  -9.48560010e-01,
         3.15579377e-01,   5.54596913e-01,  -1.72659720e-01,
         3.19899672e-01,   4.67266745e-01,  -1.96626712e+00,
         9.63485263e-01,  -6.29138529e-01,  -7.19402053e-01,
        -5.71313424e-01,  -6.17415331e-01,  -5.81660900e-01,
        -1.23498650e+00,   1.30105446e+00,  -9.05193486e-01,
        -7.04409851e-01,  -5.35163258e-01,   4.47342865e-01,
         6.13642584e-01,   3.99382303e-01,   2.34965327e+00,
        -2.38150580e-01,  -1.11352363e+00,  -6.58679675e-01,
         9.79641476e-02,  -7.41026309e-01,  -2.91145805e-01,
         1.27430779e+00,   6.39987259e-01,  -9.15237829e-01,
        -6.69828341e-01,  -5.21381910e-02,  -1.52349213e+00,
        -8.17093396e-01,  -6.26637232e-01,  -1.21455219e-01,
        -4.19964824e-01,  -1.73899890e-01,  -1.30734014e+00,
        -2.05935868e-01,  -8.31786056e-01,  -2.41364780e-01,
        -3.53768363e-01,  -1.51065582e+00,  -4.69797852e-01,
        -3.57675298e-02,   6.73481614e-01,  -4.80239179e-01,
        -4.80062675e-02,   4.38932132e-01,  -3.35058464e-01,
        -1.16350662e+00,   1.73864754e+00,   2.96151261e-02,
        -8.51484117e-01,  -1.33801992e+00,  -8.05475201e-01,
         7.61481974e-02,   1.84217236e-01,   1.74115388e-01,
        -3.09785537e-01,  -1.64494504e-01,   4.80479411e-01,
         1.35050673e+00,  -4.30282742e-01,   5.52100876e-01,
         2.63498864e+00,   6.10138144e-01,   5.63288094e-01,
         2.29317677e+00,  -3.52222312e-01,   2.70942796e+00,
        -1.80789690e+00,   2.82738854e-01,  -1.63002044e-01,
         1.15928955e-01,   8.53045125e-01,   1.93694961e-01,
        -1.55392456e+00,   1.41090002e+00,   2.49075676e+00,
         1.85897989e+00,   1.50907883e+00,   9.28055627e-01,
        -3.93739352e-01,   4.69569779e-01,  -1.01759098e+00,
         2.66882941e-01,  -1.98404147e+00,  -1.94035512e+00,
        -9.48759679e-02,  -2.06540820e+00,  -6.86679204e-01,
        -5.67363451e-01,   1.00304397e+00,   9.64798515e-01,
         7.69331273e-02,  -1.16124948e+00,   2.98931436e-01,
         5.47790468e-01,   2.25797192e-01,   7.84960704e-01,
        -7.12711057e-01,   1.29347994e+00,   2.98665792e-01,
        -1.80898695e+00,  -7.30192118e-01,  -1.32996415e+00,
         7.77261603e-01,   2.69050129e-01,   3.71096395e-01,
         1.31558810e+00,  -5.17375871e-01,  -4.98467207e-01,
         1.32069842e+00,  -3.69661261e-02,   2.59371673e-01,
         1.28622175e+00,  -3.81761923e-01,   7.63535574e-01,
         1.15657500e+00,   7.91830233e-01,  -5.54568705e-03,
        -7.75992475e-01,  -1.73450033e-01,   6.90443953e-01,
         7.93841396e-01,   1.65085536e+00,  -1.36356144e+00,
         9.28038621e-01,   2.15313548e+00,  -5.63270423e-01,
        -2.04398521e-01,   7.89603289e-01,   9.00000977e-01,
         2.20515188e-01,  -1.00273372e+00,  -1.88346485e+00,
        -1.00460227e-01,  -2.47412107e-01,  -4.83951725e-01,
        -3.54340005e-02,   4.78913865e-01,   3.19619916e-01,
        -5.10011810e-01,  -1.47184208e+00,   1.29496892e+00,
         1.05731906e+00,  -2.66629787e-01,   5.29506746e-01,
         1.58159785e+00,  -1.76316018e+00,   2.94389732e-01,
        -3.40497772e-01,   2.91780911e-01,  -1.12924380e+00,
        -2.67064965e+00,  -1.08127809e+00,  -1.04113243e+00,
         3.56119769e-02,  -1.42564960e+00,  -1.35356749e+00,
        -1.60624596e+00,   4.66150900e-01,   1.19140939e+00,
        -7.81498463e-02,   1.10339186e+00,  -1.54053758e+00,
         7.26646965e-01,   6.97713350e-01,   4.28582125e-01,
        -6.60015930e-01,   9.53355839e-01,   9.41090712e-01,
        -8.91128606e-01,  -1.48901262e+00,  -1.07441288e+00,
        -1.11556024e+00,   1.52220444e-01,   5.83196094e-01,
        -1.19504120e+00,  -1.40323974e+00,   7.83417674e-01,
        -1.70070010e+00,  -8.10033588e-01,   3.37752829e-01,
        -1.66982230e+00,   3.58304873e-01,   6.20784232e-01,
        -3.70015913e-01,   2.34436819e-01,   8.70120290e-01,
        -2.04200611e+00,  -1.03336320e-02,  -4.26897645e-01,
        -1.08137822e+00,   1.15323650e+00,  -1.85285666e+00,
         7.97960702e-01,   5.25055393e-01,  -4.96742803e-01,
        -8.88163948e-01,  -5.45870789e-01,  -3.84433734e-01,
         9.32725538e-01,   7.83871348e-01,  -1.28816741e+00,
         1.08698587e-01,   3.89990628e-01,  -5.76847365e-01,
        -8.64063242e-02,  -6.92500535e-01,   2.53643944e-01,
        -9.79464611e-01,  -7.63367194e-01,  -2.48738309e-01,
         4.87008226e-01,   9.13003666e-01,   3.18515019e-01,
         1.67904613e-01,  -7.03949411e-01,   8.59375255e-01,
         7.49191669e-01,  -1.33140965e+00,  -5.93830750e-01,
        -6.00938645e-01,  -1.24953452e-01,   3.31288249e-01,
        -3.46236352e-01,   1.25064606e+00,  -1.71610951e+00,
        -5.92536965e-01,   7.98312458e-01,  -3.69504913e-01,
         6.82667889e-01,  -6.28513900e-02,  -6.29726066e-01,
        -1.56705481e-01,  -1.44240994e+00,  -7.93226208e-01,
         2.32981912e-01,   1.57158613e+00,  -2.13785459e-01,
        -1.09004626e+00,  -7.37524622e-01,  -1.92166754e+00,
        -1.27499472e+00,   1.08720492e+00,  -3.40055074e-01,
         1.40342198e+00,  -6.24565711e-02,  -7.80096612e-01,
         7.24744977e-01,  -9.18356196e-01,   3.90873407e-01,
         5.57453696e-01,  -1.73235083e+00,  -1.53779386e+00,
         8.95558151e-01,   1.59239157e+00,   6.66217090e-01,
         6.28679922e-02,  -1.06165488e+00,   8.51065342e-02,
        -1.67640247e-01,   3.10905134e-02,   2.51219530e+00,
         1.39318324e+00,  -1.42944055e-01,  -1.56579805e-01,
        -3.22931240e+00,  -2.20166588e+00,   9.63256080e-01,
         7.55643980e-01,  -1.41890461e+00,   1.71124036e+00,
         3.64666501e-01,  -3.48291955e-01,   1.73620874e+00,
        -9.11555202e-01,   2.18265148e-01,  -1.81406345e-01,
        -1.50920897e+00,   5.25502923e-01,   1.90357143e+00,
         1.19334807e+00,  -6.76900161e-01,   1.10657237e+00,
         2.16013875e+00,   1.14243170e-01,   1.13424969e+00,
        -1.21531245e+00,  -2.17501206e-01,  -1.34367877e+00,
        -8.83858794e-01,   6.04023504e-01,   4.37578976e-01,
        -7.71792371e-01,   3.56892133e-01,   1.66794809e+00,
        -1.33693714e-01,  -9.52808461e-01,  -1.36591427e-01,
         1.63365727e-01,   8.75866732e-01,  -2.49524607e-01,
        -1.16340348e+00,  -1.09793104e+00,   4.08341700e-01,
        -6.95518582e-01,   5.77746743e-01,   8.11233180e-01,
         6.28942427e-01,  -9.99524207e-01,  -6.33185215e-01,
        -1.76361780e-01,   1.17534897e-01,   3.40707167e-01,
         5.45688034e-01,   7.95249994e-01,  -4.48677315e-01,
        -2.59435302e+00,   8.39203962e-01,  -6.33628101e-01,
         2.15734553e+00,   1.44123123e+00,   2.46110815e-01,
        -5.26729579e-01,   5.99076327e-01,  -1.44503606e+00,
         1.07704764e+00,  -4.71494766e-01,   4.35828003e-01,
         2.07214172e-01,   8.21897930e-01,   8.98545028e-01,
        -5.32370025e-01,  -9.01329702e-01,   2.09748230e+00,
        -6.16652057e-02,  -1.00219462e+00,  -1.01090467e+00,
         1.27785557e+00,  -7.42058567e-01,  -4.84822439e-02,
        -2.75657999e-01,   1.11423422e+00,   1.44737108e+00,

In [184]:
#4개로 같은 크기의 그룹으로 나눔
#Cut into quartiles
#qcut 함수는 표준변위치를 사용하기 때문에 적당히 같은 크기의 그룹으로 나누어짐
cats = pd.qcut(data,4)

In [185]:
cats

[(-0.71, -0.00848], (-0.71, -0.00848], (-0.00848, 0.692], (-0.71, -0.00848], [-3.229, -0.71], ..., (-0.00848, 0.692], [-3.229, -0.71], (0.692, 2.709], [-3.229, -0.71], [-3.229, -0.71]]
Length: 1000
Categories (4, object): [[-3.229, -0.71] < (-0.71, -0.00848] < (-0.00848, 0.692] < (0.692, 2.709]]

In [186]:
pd.value_counts(cats)

(0.692, 2.709]       250
(-0.00848, 0.692]    250
(-0.71, -0.00848]    250
[-3.229, -0.71]      250
dtype: int64

In [187]:
#cut 함수는 데이터의 분산에 따라 각각의 그룹마다 데이터의 개수가 다르게 나누어짐
tmp_cats = pd.cut(data,4)

In [188]:
tmp_cats

[(-0.26, 1.225], (-1.745, -0.26], (-0.26, 1.225], (-1.745, -0.26], (-1.745, -0.26], ..., (-0.26, 1.225], (-3.235, -1.745], (-0.26, 1.225], (-1.745, -0.26], (-1.745, -0.26]]
Length: 1000
Categories (4, object): [(-3.235, -1.745] < (-1.745, -0.26] < (-0.26, 1.225] < (1.225, 2.709]]

In [189]:
pd.value_counts(tmp_cats)

(-0.26, 1.225]      480
(-1.745, -0.26]     365
(1.225, 2.709]      108
(-3.235, -1.745]     47
dtype: int64

In [190]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-1.339, -0.00848], (-1.339, -0.00848], (-0.00848, 1.279], (-1.339, -0.00848], (-1.339, -0.00848], ..., (-0.00848, 1.279], [-3.229, -1.339], (-0.00848, 1.279], [-3.229, -1.339], (-1.339, -0.00848]]
Length: 1000
Categories (4, object): [[-3.229, -1.339] < (-1.339, -0.00848] < (-0.00848, 1.279] < (1.279, 2.709]]

###7.3.6 특이값 찾아내고 제외하기
- 배열연산을 수행할때는 특이값(outlier)을 제외하거나 적당한 값으로 대체하는 것이 중요

In [191]:
np.random.seed(12345)

In [192]:
#np.random.randn(row,column)
data = DataFrame(np.random.randn(1000,4))

In [193]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [194]:
col = data[3]

In [195]:
#특정 row에서 절대값이 3초과인 값을 추출
col[np.abs(col)>3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [196]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [197]:
#np.sign은 주어진 값이 부호에 따라 1 혹은 -1이 담긴 배열을 반환
#절대값이 3을 넘는 row에는 3 또는 -3을 저장
data[np.abs(data)>3] = np.sign(data)*3

In [198]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000